phytec/optee_os-phytec-stm32mp/core/arch/arm/plat-stm32mp1/link_dummies_paged.c
// SPDX-License-Identifier: BSD-2-Clause
/*
 * Copyright (c) 2022, Linaro Limited
 * Copyright (c) 2024, STMicroelectronics
 */
#include <compiler.h>
#include <drivers/clk.h>
#include <kernel/panic.h>
#include <pm/stm32mp1_psci.h>
#include <stm32_util.h>

const struct clk_ops stm32mp1_clk_ops __rodata_dummy;

#ifdef CFG_PAGED_PSCI_SYSTEM_SUSPEND
uint32_t __section(".text.dummy.__psci_system_suspend")
__psci_system_suspend(uintptr_t entry __unused,
		      uint32_t context_id __unused,
		      struct sm_nsec_ctx *nsec __unused)
{
	return 0;
}
#endif

#ifdef CFG_PAGED_PSCI_SYSTEM_OFF
void __section(".text.dummy.__psci_system_off") __noreturn
__psci_system_off(void)
{
	panic();
}
#endif

#if defined(CFG_PAGED_PSCI_CPU_SUSPEND) && defined(CFG_STM32_PSCI_OSI)
int __section(".text.dummy.__psci_cpu_suspend")
__psci_cpu_suspend(uint32_t power_state __unused,
		   uintptr_t entry __unused,
		   uint32_t context_id __unused,
		   struct sm_nsec_ctx *nsec __unused)
{
	return 0;
}
#endif
